app/views/trips/new.html.erb

SELECT "stops"."name", "stops"."id" FROM "stops"
---
    <%= f.label :start_id  %>
    <%= f.select :start_id, Stop.pluck(:name, :id) %>
    <%= f.label :end_id  %>
    <%= f.select :end_id, Stop.pluck(:name, :id)  %>