app/controllers/application_controller.rb

    def fetch_user
      @current_user = User.find_by :id => session[:user_id] if session[:user_id].present?
      session[:user_id] = nil unless @current_user.present?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def generate_map_data
      @scale = 500/25
      @stops = Stop.all
      @pair_points = Edge.all.map {|e| [
        Stop.find(e.from_id).location_x,
        Stop.find(e.from_id).location_y,
        Stop.find(e.to_id).location_x,
        Stop.find(e.to_id).location_y
      ]}
---
SELECT  "stops".* FROM "stops" WHERE "stops"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]