app/controllers/pages_controller.rb

  def home
    @scale = 500/25
    @stops = Stop.all
    # for edge in @edges do
    #   from = @stops[edge.from_id]
    #   from_x = from.location_x
    #   from_y = from.location_y
    #   to = @stops[edge.to_id]
    #   to_x = to.location_x
    #   to_y = to.location_y
    puts "###################################################"
    @pair_points = Edge.all.map {|e| [
      Stop.find(e.from_id).location_x,
      Stop.find(e.from_id).location_y,
      Stop.find(e.to_id).location_x,
      Stop.find(e.to_id).location_y
    ]}
---
SELECT "stops".* FROM "stops"
SELECT  "stops".* FROM "stops" WHERE "stops"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]