app/controllers/pages_controller.rb

SELECT "edges".* FROM "edges"
---
  def home
    @stops = Stop.all
    @edges = Edge.all