app/controllers/session_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "mcdojj12@gmail.com"], ["LIMIT", 1]]
---
  def create
    # creates the session, ie logs in and stores the users creds.
    user = User.find_by :email => params[:email]