app/controllers/transactions_controller.rb

  def update_balance
    @current_user.transactions.create(transaction_params)
    @current_user.balance = @current_user.balance.to_i + transaction_params[:amount].to_i
    @current_user.save
---
INSERT INTO "transactions" ("user_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 7], ["amount", "10.0"], ["created_at", "2020-06-25 10:54:20.659776"], ["updated_at", "2020-06-25 10:54:20.659776"]]
UPDATE "users" SET "balance" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["balance", 103.0], ["updated_at", "2020-06-25 11:02:16.200665"], ["id", 7]]

  def index
    @transactions = Transaction.all
---
SELECT "transactions".* FROM "transactions"