app/controllers/trips_controller.rb

  def index
    @trips = Trip.all
---
SELECT "trips".* FROM "trips"

  def all
    @trips = Trip.all
---
SELECT "trips".* FROM "trips"

  def create
    trip_cost = 10
    @current_user.balance -= trip_cost
    @current_user.trips.create(trip_params)
    @current_user.save
---
INSERT INTO "trips" ("user_id", "start_id", "end_id", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 2], ["start_id", 1], ["end_id", 1], ["date", "6969-03-03"], ["created_at", "2020-06-25 07:31:40.328799"], ["updated_at", "2020-06-25 07:31:40.328799"]]
UPDATE "users" SET "balance" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["balance", 93.0], ["updated_at", "2020-06-25 11:03:49.263033"], ["id", 7]]